Tekla Open API Reference for Tekla Structures 2025
BaseLineWithArrowAtStartPointPlacingType Class
 The BaseLineWithArrowAtStartPointPlacingType class defines a placing type that places the object using the base line placing. The line is drawn and will have an arrow at the start point.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.BaseLineWithArrowAtStartPointPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class BaseLineWithArrowAtStartPointPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class BaseLineWithArrowAtStartPointPlacingType
	Inherits PreferredPlacingTypeBase
The BaseLineWithArrowAtStartPointPlacingType type exposes the following members.
Constructors
Name | Description
BaseLineWithArrowAtStartPointPlacingType
 Creates a new base line with arrow at start point placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace